tech_process_form = {
    "菲林": {
        "operater": "",   # 制作员
        "date1": "",    # 接单时间
        "date2": "",   # 完成时间
        "record": "",   # 更改记录
        "line_num": "",   # 挂网线数
        "width": "",   # 叠色宽度
        "table_data": {    # 对应表格数据
            "title": ["菲林序号", "1", "2", "3", "4", "5", "6", "7"],
            "data": [
                [False, False, False, False, False, False, False],  # 颜色行
                ["", "", "", "", "", "", ""],     # 备注行
            ],
            "head": ["颜色", "备注"]
        }
    },
    "版房" : {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "table_data": {
            "title": ["网序", "1", "2", "3", "4", "5", "6"],
            "data": [
                ["", "", "", "", "", ""],  # 网纱目数行
                ["", "", "", "", "", ""],  # 感光胶厚度行
                ["", "", "", "", "", ""],  # 曝光时间行
            ],
            "head": ["网纱目数", "感光胶厚度", "曝光时间"]
        }
    },
    "调色" : {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "remark": "",   # 备注
        "table_data": {
            "title": ["调色序号", "防护底", "打底浆", "1", "2", "3", "防护面"],
            "data": [
                ["", "", "", "", "", ""],   # 调色行
            ],
            "head": ["调色"]
        }
    },
    "打样" : {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "temperature": "",  # 过炉温度
        "time": "",   # 过炉时间
        "remark": "",   # 过炉备注
        "table_data": {
            "title": [
                {
                    "value": ["布色", "菲林网序", "1", "2", "3", "4", "5", "6", "7"],
                    "rowspan": ["2", "1", "1", "1", "1", "1", "1", "1", "1"],
                    "colspan": ["1", "1", "1", "1", "1", "1", "1", "1", "1"],
                },
                {
                    "value": ["刮刀硬度", "", "", "", "", "", "", ""],    # 对应标题中刮刀硬度行
                    "rowspan": ["1", "1", "1", "1", "1", "1", "1", "1"],
                    "colspan": ["1", "1", "1", "1", "1", "1", "1", "1"],
                },
            ],
            "data": [
                {
                    "value": ["", "刀数/次数", "", "", "", "", "", "", ""],   # 对应数据第1行，依次为布色，刀数/次数，1～7
                    "rowspan": ["3", "1", "1", "1", "1", "1", "1", "1", "1"],
                },
                {
                    "value": ["颜色/色号", "", "", "", "", "", "", ""], # 对应数据第2行，依次为颜色/色号，1～7
                    "rowspan": ["1", "1", "1", "1", "1", "1", "1", "1"], 
                },
                {
                    "value": ["材料名称", "", "", "", "", "", "", ""],  # 对应数据第3行，依次为材料名称，1～7
                    "rowspan": ["1", "1", "1", "1", "1", "1", "1", "1"],
                },
            ]
        }
    },
    "压烫": {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "temperature": "", # 温度
        "time": "",  # 时间
        "pressure": "",   # 压力
        "method": "",   # 辅助方法
        "direction_yes": False,  # 方向 正
        "direction_no": False,   # 方向 反
        "hot": False,  # 撕胶 冷撕
        "cold": False, # 撕胶 热撕
    },
    "雕刻" : {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "method": "",     # 辅助方法
        "table_data_1": [
            {"index": 1, "v1": "", "v2": "", "v3":"", "v4": "", "v5": "", "v6": "", "v7":"", "v8": "", "v9": "", "v10":"", "v11":""},
            {"index": 2, "v1": "", "v2": "", "v3":"", "v4": "", "v5": "", "v6": "", "v7":"", "v8": "", "v9": "", "v10":"", "v11":""},
            {"index": 3, "v1": "", "v2": "", "v3":"", "v4": "", "v5": "", "v6": "", "v7":"", "v8": "", "v9": "", "v10":"", "v11":""},
        ], # v1到v11依次是：材料名称/编号，厚度，颜色，胶模型号，不干胶粘性型号，不干胶厚度，负荷温度，负荷时间，负荷压力，备注，胶模厚度
        "table_data_2": [
            {"index": 1, "v1": "", "v2": "", "v3":"", "v4": "", "v5": "", "v6": "", "v7":"", "v8": "", "v9": "", "v10":"", "v11":"", "direction_yes": False, "direction_no": False, "si_yes": False, "si_no": False},
            {"index": 2, "v1": "", "v2": "", "v3":"", "v4": "", "v5": "", "v6": "", "v7":"", "v8": "", "v9": "", "v10":"", "v11":"", "direction_yes": False, "direction_no": False, "si_yes": False, "si_no": False},
            {"index": 3, "v1": "", "v2": "", "v3":"", "v4": "", "v5": "", "v6": "", "v7":"", "v8": "", "v9": "", "v10":"", "v11":"", "direction_yes": False, "direction_no": False, "si_yes": False, "si_no": False},
        ] # v1～v11依次是：频率，速度，次数，脉宽，开光延时，关光延时，拐角延时，关光延时，压烫温度，压烫时间，压烫压力。direction_yes：方向正，direction_no：方向反，si_yes：撕胶冷，si_no：撕胶热
    },
    "直喷" : {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "acc": "",   # AI图稿精确度
        "num": "",  # 挂网线数
        "attention": "", # 注意事项
        "table_data": {
            "title": ["序号", "材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"],
            "data": [
                ["", "", "", "", "", "", "", ""],  # 对应表格数据第1行，依次对应："材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"
                ["", "", "", "", "", "", "", ""], # 对应表格数据第2行，依次对应："材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"
                ["", "", "", "", "", "", "", ""], # 对应表格数据第3行，依次对应："材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"
            ],  
            "head": ["1", "2", "3"]
        }
    },
    "高频" : {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "process_index": "8",
        "process_name": "高频",
        "index": "",    # 模具编号
        "height": "", # 模具厚度
        "specification": "",  # 规格
        "name": "",   # 模具名称
        "num": "",   # 排版数量
        "temperature": "", # 温度
        "time": "",  # 时间
        "pressure": "",   # 压力
        "method": "",   # 辅助方法
        "direction_yes": False,  # 正方向
        "direction_no": False, # 反方向
        "cold": False, # 冷撕
        "hot": False, # 热撕
        "table_data": {
            "title": ["序号", "材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"],
            "data": [
                ["", "", "", "", "", "", "", ""], # 对应表格数据第1行，依次对应："材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"
                ["", "", "", "", "", "", "", ""], # 对应表格数据第2行，依次对应："材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"
                ["", "", "", "", "", "", "", ""], # 对应表格数据第3行，依次对应："材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"
            ],
            "head": ["1", "2", "3"]
        }
    },
    "植胶" : {    # 与高频完全一致
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "process_index": "9",
        "process_name": "植胶",
        "index": "",
        "height": "",
        "specification": "",
        "name": "",
        "num": "",
        "temperature": "", # 温度
        "time": "",  # 时间
        "pressure": "",   # 压力
        "method": "",   # 辅助方法
        "direction_yes": False,
        "direction_no": False,
        "cold": False,
        "hot": False,
        "table_data": {
            "title": ["序号", "材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"],
            "data": [
                ["", "", "", "", "", "", "", ""],
                ["", "", "", "", "", "", "", ""],
                ["", "", "", "", "", "", "", ""],
            ],
            "head": ["1", "2", "3"]
        }
    },
    '立体钢压' : {   # 与高频完全一致
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "process_index": "10",
        "process_name": "立体钢印",
        "index": "",
        "height": "",
        "specification": "",
        "name": "",
        "num": "",
        "temperature": "", # 温度
        "time": "",  # 时间
        "pressure": "",   # 压力
        "method": "",   # 辅助方法
        "direction_yes": False,
        "direction_no": False,
        "cold": False,
        "hot": False,
        "table_data": {
            "title": ["序号", "材料名称", "厚度", "颜色", "数量", "花型", "纹理方向", "排版规格", "排版数量"],
            "data": [
                ["", "", "", "", "", "", "", ""],
                ["", "", "", "", "", "", "", ""],
                ["", "", "", "", "", "", "", ""],
            ],
            "head": ["1", "2", "3"]
        }
    },
    '升华转移' : {
        "operater": "",
        "date1": "",
        "date2": "",
        "record": "",
        "table_data": {
            "title": [
                {
                    "value": ["序号", "材料/布料编号", "材料/布料编号", "颜色", "数量", "温度", "速度", "印前", "印后"],
                    "rowspan": ["2", "2", "2", "2", "2", "2", "2", "1", "1"],
                    "colspan": ["1", "1", "1", "1", "1", "1", "1", "3", "3"],
                },
                {
                    "value": ["克重", "幅宽", "长度", "克重", "幅宽", "长度"],
                    "rowspan": ["1", "1", "1", "1", "1", "1"],
                    "colspan": ["1", "1", "1", "1", "1", "1"],
                },
            ],
            "data": [
                ["", "", "", "", "", "", "", "", "", "", "", ""], # 对应数据第1行，依次是："材料/布料编号", "材料/布料编号", "颜色", "数量", "温度", "速度", "印前克重", "印前幅宽", "印前长度", "印后克重", "印后幅宽", "印后长度"
                ["", "", "", "", "", "", "", "", "", "", "", ""], # 对应数据第2行，依次是："材料/布料编号", "材料/布料编号", "颜色", "数量", "温度", "速度", "印前克重", "印前幅宽", "印前长度", "印后克重", "印后幅宽", "印后长度"
                ["", "", "", "", "", "", "", "", "", "", "", ""], # 对应数据第3行，依次是："材料/布料编号", "材料/布料编号", "颜色", "数量", "温度", "速度", "印前克重", "印前幅宽", "印前长度", "印后克重", "印后幅宽", "印后长度"
            ],
            "head": ["1", "2", "3"]
        }
    },
    "abnormal_form": {
        "abnormal": "",   # 开发异常
        "risk": "",  # 风险/产能评估
        "solve": "", # 解决方案
    },

}